app/views/collaborators/show.html.erb

        <td>
          <% if @post.user_collaborators.include?(user) %>
---
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."post_id" = ? AND "collaborators"."user_id" = ? ORDER BY "collaborators"."id" ASC LIMIT ?  [["post_id", 49], ["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."post_id" = ? AND "users"."id" = ? LIMIT ?  [["post_id", 49], ["id", 1], ["LIMIT", 1]]