app/controllers/charges_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND (private = 't')  [["user_id", 7]]
---
  def downgrade
    @private_posts = Post.where( "private='t' AND user_id=?", current_user.id ) # User private wiki list

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", 2017-03-22 18:00:50 UTC], ["id", 20]]
---
  def create
    # Creates a Stripe Customer object, for associating
    # with the charge
    customer = Stripe::Customer.create(
      email: current_user.email,
      card: params[:stripeToken]
    )

    # Where the real magic happens
    charge = Stripe::Charge.create(
      customer: customer.id, # Note -- this is NOT the user_id in your app
      #amount: Amount.default,
      amount: 10_00,
      description: "Wikiikki Premium Membership - #{current_user.email}",
      currency: 'usd'
    )

    # Change User role to premium
    User.find(current_user.id).update_attribute( :role, 'premium')