app/controllers/collaborators_controller.rb

INSERT INTO "collaborators" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 49], ["created_at", 2017-02-11 23:40:56 UTC], ["updated_at", 2017-02-11 23:40:56 UTC]]
---
  def create
    @collaborator = Collaborator.new
    @collaborator.user_id=params[:user_id]
    @collaborator.post_id=params[:post_id]
    if @collaborator.save # Calling database save/insert command

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 2]]
---
  def destroy
    @post=Post.find(params[:post_id])
    authorize @post
    @collaborator = Collaborator.find(params[:id])
    @user=User.find( @collaborator.user_id )

    if @collaborator.destroy